<?php

use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class CreateNameLangTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('name_lang', function (Blueprint $table) {
            $table->increments('ID');
            $table->integer('MALE_ID');
            $table->string('FNAME');
            $table->string('MALE_SNAME');
            $table->string('FEMALE_SNAME');
            $table->string('LANG');
        });

        DB::statement("INSERT INTO `name_lang` VALUES (1,1,'Артем','Артемович','Артемовна','ru'),(2,2,'Валентина',NULL,NULL,'ru'),(3,1,'Сергей','Сергеевич','Сергеевна','ru'),(4,1,'Виктор','Викторович','Викторовна','ru'),(5,2,'Татьяна',NULL,NULL,'ru'),(6,2,'Зоя',NULL,NULL,'ru'),(7,1,'Андрей','Андреевич','Андреевна','ru'),(8,1,'Борис','Борисович','Борисовна','ru'),(9,1,'Николай','Николаевич','Николаевна','ru'),(10,1,'Иван','Иванович','Ивановна','ru'),(11,1,'Аким','Акимович','Акимовна','ru'),(12,2,'Анна',NULL,NULL,'ru'),(13,2,'Вера',NULL,NULL,'ru'),(14,1,'Artiom','Artiomovich','Artiomovna','en'),(15,2,'Прасковья','','','ru'),(16,2,'Proskovya','','','en'),(17,1,'Дмитрий','Дмитриевич','Дмитриевна','ru'),(18,1,'Dmitriy','Dmitrievich','Dmitrievna','en'),(19,1,'Александр','Александрович','Александровна','ru'),(20,1,'Григорий','Григорьевич','Григорьевна','ru'),(21,2,'Агафья','','','ru'),(22,2,'Галина','','','ru'),(23,2,'Дарья','','','ru'),(24,1,'Игорь','Игоревич','Игоревна','ru'),(25,1,'Ярослав','Ярославович','Ярославовна','ru'),(26,2,'Марина','','','ru'),(27,1,'Гаврил','Гаврилович','Гавриловна','ru'),(28,2,'Евдокия','','','ru'),(29,1,'Федор','Федорович','Федоровна','ru'),(30,1,'Fyodor','Fyodorovich','Fyodorovna','en'),(31,2,'Екатерина','','','ru'),(32,2,'Ekaterina','','','en'),(33,2,'Людмила','','','ru'),(34,2,'Марфа','','','ru'),(35,2,'Надежда','','','ru'),(36,1,'Валерий','Валерьевич','Валерьевна','ru'),(37,1,'Петр','Петрович','Петровна','ru'),(38,1,'Peter','Petrovich','Petrovna','en'),(39,2,'Варвара','','','ru'),(40,1,'Михаил','Михайлович','Михайловна','ru'),(41,1,'Кузьма','Кузьмич','Кузьминична','ru'),(42,1,'Никифор','Никифорович','Никифоровна','ru'),(43,1,'Трофим','Трофимович','Трофимовна','ru'),(44,1,'Прокофий','Прокофьевич','Прокофьевна','ru'),(45,1,'Павел','Павлович','Павловна','ru'),(46,1,'Илья','Ильич','Ильинична','ru'),(47,1,'Валентин','Валентинович','Валентиновна','ru'),(48,1,'Антон','Антонович','Антоновна','ru'),(49,2,'Александра','','','ru'),(50,1,'Геннадий','Геннадьевич','Геннадьевна','ru'),(51,2,'Лидия','','','ru'),(52,1,'Василий','Васильевич','Васильевна','ru'),(53,2,'Антонина','','','ru'),(54,1,'Владимир','Владимирович','Владимировна','ru'),(55,2,'Ирина','','','ru'),(56,1,'Анатолий','Анатольевич','Анатольевна','ru'),(57,1,'Ермолай','Ермолаевич','Ермолаевна','ru'),(58,2,'Матрена','','','ru'),(59,2,'Агрепена','','','ru'),(60,2,'Марья','','','ru'),(61,1,'Никита','Никитич','Никитична','ru'),(62,2,'Нина','','','ru'),(63,2,'Елена','','','ru'),(64,2,'Анастасия','','','ru'),(65,2,'Маира','','','ru'),(66,2,'Агафена','','','ru'),(67,1,'Алексей','Алексеевич','Алексеевна','ru'),(68,1,'Яков','Яковлевич','Яковлевна','ru'),(69,1,'Ивлий','Ивлевич','Ивлевна','ru'),(70,1,'Akim','Akimovich','Akimovna','en'),(71,1,'Матвей','Матвеевич','Матвеевна','ru'),(72,2,'Любовь','','','ru'),(73,1,'Юрий','Юрьевич','Юрьевна','ru'),(74,1,'Леонид','Леонидович','Леонидовна','ru'),(75,2,'Лариса','','','ru'),(76,2,'Светлана','','','ru'),(77,2,'Нелля','','','ru'),(78,1,'Евгений','Евгениевич','Евгеньевна','ru'),(79,2,'Ксения','','','ru'),(80,1,'Лев','Львович','Львовна','ru'),(81,1,'Семен','Семенович','Семеновна','ru'),(82,2,'Ольга','','','RU'),(83,1,'Гавриил','Гаврилович','Гаврииловна','RU'),(84,2,'Фекла','','','RU'),(85,1,'Константин','Константинович','Константиновна','RU'),(86,1,'Роман','Романович','Романовна','RU'),(87,2,'Мария','','','RU'),(88,1,'Вячеслав','Вячеславович','Вячеславовна','RU')");

  

        $mixed_name_lang = DB::table('mixed_name_lang')->get();
        $name_lang = DB::table('name_lang')->where('LANG', 'ru')->get();
        
        $inserts = array();
        $mixed   = array();
        foreach ($mixed_name_lang as $name) {
            $mixed[$name->NAME_LANG_ID] = $name->NAME_ID;
        };


        foreach ($name_lang as $name) {
            $id  = $mixed[$name->ID];
            $sex = ($name->MALE_ID == 1) ? 'm' : 'f';

            $inserts[$id] = array(
                'id'            => $id,
                'sex'           => $sex,
                'fname'         => $name->FNAME,
                'male_lname'    => $name->MALE_SNAME,
                'female_lname'  => $name->FEMALE_SNAME,
                'created_at'    => time(),
            );
        };

        DB::table('name')->insert($inserts);

    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('name')->truncate();
        Schema::drop('name_lang');
    }
}
